Revit 2027 API
HostObjectUtils.GetSideFaces Method
 Returns the major side faces for this host object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IList<Reference> GetSideFaces(
	HostObject hostObject,
	ShellLayerType side
)
Public Shared Function GetSideFaces (
	hostObject As HostObject,
	side As ShellLayerType
) As IList(Of Reference)
public:
static IList<Reference^>^ GetSideFaces(
	HostObject^ hostObject,
	ShellLayerType side
)
static member GetSideFaces :
        hostObject : HostObject *
        side : ShellLayerType -> IList<Reference>
Parameters
hostObject HostObject
 The host object.
side ShellLayerType
 The side of the host object.
Return Value
IList<Reference>
 An array of references to the faces which are on the given side of this element.
Exceptions
Exception | Condition
ArgumentException |  This host object does not support access to side faces.
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
Remarks
 This utility supports host objects whose CompoundStructure is nominally oriented vertically. It outputs faces which are at the boundary of the CompoundStructure (such as Walls and FaceWalls).
See Also
Reference
HostObjectUtils Class
Autodesk.Revit.DB Namespace